Repository: TheFieryLynx/FlappyBird
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome to Flappy Bird's documentation!
ru: Добро пожаловать в документацию Flappy Bird!

source: Class representing and controlling the game's background.
ru: Класс, представляющий фон игры и управляющий им.

source: Change the chosen baackground to the left side background on the screen (cyclically).
ru: Изменяет выбранный фон влево (циклически).

source: Change the chosen baackground to the right side background on the screen (cyclically).
ru: Изменяет выбранный фон вправо (циклически).

source: Return current background image.
ru: Возвращает текущее фоновое изображение.

source: Class representing and controlling a barrier's sprite in the game.
ru: Класс, управляющий спрайтами барьеров в игре.

source: Change the chosen barrier to the left side barrier on the screen (cyclically).
ru: Изменяет выбранный барьер влево (циклически).

source: Change the chosen barrier to the right side barrier on the screen (cyclically).
ru: Изменяет выбранный барьер вправо (циклически).

source: Return the barrier's current center coordinates.
ru: Возвращает текущие координаты центра барьеров.

source: Reset the barrier's position to initial.
ru: Возвращает положение барьера в исходное.

source: Set barrier's coordinates.
ru: Установка координатов барьеров.

source: Parameters
ru: Параметры

source: Horizontal coordinate value to set.
ru: Значение координаты по горизонтали.

source: Vertical coordinate value to set.
ru: Значение координаты по вертикали

source: Imitate the barrier moving towards the bird.
ru: Имитирует движение птицы навстречу птице.

source: Class representing and controlling a bird's sprite in the game.
ru: Класс, управляющий спрайтами птицы в игре.

source: Change the chosen bird to the bird below on the screen (cyclically).
ru: Изменяет выбранную птицу вниз (циклически).

source: Change the chosen bird to the left side bird on the screen (cyclically).
ru: Изменяет выбранную птицу влево (циклически).

source: Change the chosen bird to the right side bird on the screen (cyclically).
ru: Изменяет выбранную птицу вправо (циклически).

source: Change the chosen bird to the bird up on the screen (cyclically).
ru: Изменяет выбранную птицу вверх (циклически).

source: Change the bird's picture to a picture depicting the next position of the bird.
ru: Изменение изображение птицы на следующее

source: Imitate the bird's jump up.
ru: Имитация прыжка птицы

source: Reset the bird's position to initial and stop the bird from falling.
ru: Возврат положения птицы в исходное и предотвращение падения птицы.

source: Set initial bird's coordinates corresponding to settings.
ru: Установка начальных координат птицы в соответствии с настройками.

source: Imitate the bird moving forward and falling.
ru: Имитация движения птицы вперед и падение.

source: Class representing and controlling a coin's sprite in the game.
ru: Класс, управляющий спрайтами монеты в игре.

source: Reset the coin's position to initial.
ru: Возврат положения монеты в исходное.

source: Set coin's coordinates.
ru: Установка координат монеты.

source: Change the coin's to a picture depicting the next position of the coin. Move the coin towards the bird.
ru: Замените изображение монетки на следующее. Переместить монету в сторону птицы.

source: Class representing and controlling the player's coin score.
ru: Класс, управляющий подсчетом количества монет в игре.

source: Increase the player's coin score by one.
ru: Увеличить количество монет на 1.

source: Reset the player's coin score to zero.
ru: Сбросить счетчик количества монет.

source: Display current coin score on the screen.
ru: Отрисовать текущее количество монет на экран.

source: Game's screen.
ru: Экран игры.

source: Class representing and controlling the game's frame. Frame is a thin line at the bottom of the screen, which is needed to control the fall of the bird to the ground.
ru: Класс, управляющий фреймами игры. Рамка - это тонкая линия в нижней части экрана, которая необходима для контроля падением птицы на землю.

source: Class representing and controlling the player's score.
ru: Класс, управляющий счетом игрока.

source: Increase the player's score by one.
ru: Увеличить счет на 1.

source: Reset the player's score to zero.
ru: Сбросить счет игрока.

source: Display final score on the screen.
ru: Отрисовать финальный счет на экран.

source: Display current score on the screen.
ru: Отрисовать текущий счет на экран.

source: Class representing and controlling the game's screen.
ru: Класс, управляющий экраном игры.

source: Display an image on the scrren.
ru: Отрисовать изображение на экране.

source: Image to display.
ru: Изображение.

source: Horizontal and vertical screen offset to display the image.
ru: Отступы по вертикали и горизонтали от края экрана.

source: Enum representing all possible game screen states.
ru: Enum, содержащий все возможные состояния экрана игры.

source: Display background settings screen and listen for keydown events.
ru: Отобразить экран настройки фонового изображения.

source: Display barrier settings screen and listen for keydown events.
ru: Отобразить экран настройки изображения барьеров.

source: Display bird settings screen and listen for keydown events.
ru: Отобразить экран настройки изображения птицы.

source: Display game over screen and listen for keydown events.
ru: Отобразить экран окончания игры.

source: Start the game and update every game component on clock tick or keydown event.
ru: Начать игру и обновлять состояние игры каждый тик.

source: Display game start screen and listen for keydown events.
ru: Отобразить начальный экран.

source: Indices and tables
ru: Индексы и таблицы
